# Taps

# CLI Tools - General Utilities & Power User Tools
brew "bash"
brew "bat"
brew "coreutils"
brew "fastfetch"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "lsd"
brew "mac-cleanup-py"
brew "mkdocs"
brew "moreutils"
brew "nano"
brew "nanorc"
brew "ncdu"
brew "nethogs"
brew "nmap"
brew "openssh"
brew "pandoc"
brew "paperkey"
brew "pinentry-mac"
brew "poppler"
brew "pwgen"
brew "qemu"
brew "qrencode"
brew "rclone"
brew "tealdeer"
brew "topgrade"
brew "trash"
brew "tree"
brew "watch"
brew "wget"
brew "zsh"

# Repo essentials
brew "gum"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "xcodegen"

# Languages / runtimes
brew "deno"
brew "go"
brew "python@3.12"
brew "pipx"
brew "pyenv"
brew "openjdk"

# CLI Tools - Media
brew "ffmpeg"
brew "chromaprint"    # Core component of the AcoustID project (Audio fingerprinting)
brew "whisper-cpp"
brew "yt-dlp"

# Casks - General Applications & Utilities
cask "4k-video-downloader+", greedy: true
cask "a-better-finder-rename", greedy: true
cask "adapter", greedy: true
cask "aldente", greedy: true
cask "appcleaner", greedy: true
cask "arctic", greedy: true
cask "audio-hijack", greedy: true
cask "auto-claude", greedy: true
cask "balenaetcher", greedy: true
cask "brave-browser", greedy: true
cask "calibre", greedy: true
cask "claude-code", greedy: true
cask "cryptomator", greedy: true
cask "descript", greedy: true
cask "discord", greedy: true
cask "disk-drill", greedy: true
cask "dropbox", greedy: true
cask "etrecheckpro", greedy: true
cask "farrago", greedy: true
cask "firefox", greedy: true
cask "fission", greedy: true
cask "folx", greedy: true
cask "github", greedy: true
cask "google-chrome", greedy: true
cask "google-chrome@canary", greedy: true
cask "google-drive", greedy: true
cask "gpg-suite-no-mail", greedy: true
cask "handbrake-app", greedy: true
cask "helium-browser", greedy: true
cask "ilok-license-manager", greedy: true
cask "iterm2", greedy: true
cask "izotope-product-portal", greedy: true
cask "jordanbaird-ice", greedy: true
cask "keka", greedy: true
cask "keyboardcleantool", greedy: true
cask "kid3", greedy: true
cask "kobo", greedy: true
cask "loopback", greedy: true
cask "losslesscut", greedy: true
cask "macfuse", greedy: true
cask "macwhisper", greedy: true
cask "mdrp", greedy: true
cask "mediainfo", greedy: true
cask "minecraft", greedy: true
cask "nordpass", greedy: true
cask "nordvpn", greedy: true
cask "omnidisksweeper", greedy: true
cask "onyx", greedy: true
cask "openaudible", greedy: true
cask "openmtp", greedy: true
cask "piezo", greedy: true
cask "pulsar", greedy: true
cask "raspberry-pi-imager", greedy: true
cask "raycast", greedy: true
cask "screenflow", greedy: true
cask "shutter-encoder", greedy: true
cask "signal", greedy: true
cask "slack", greedy: true
cask "softraid"
cask "soundsource", greedy: true
cask "stats", greedy: true
cask "steam", greedy: true
cask "subler", greedy: true
cask "swift-publisher", greedy: true
cask "the-unarchiver", greedy: true
cask "timemachineeditor", greedy: true
cask "typora", greedy: true
cask "utm", greedy: true
cask "veracrypt", greedy: true
cask "vlc", greedy: true
cask "waves-central", greedy: true
cask "whatsapp", greedy: true
cask "zoom", greedy: true

