brew "libpng"
brew "autoconf"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "ffmpeg"
brew "flac"
brew "unbound"
brew "chromaprint"
brew "coreutils"
brew "fastfetch"
brew "gh"
brew "git"
brew "gnupg"
brew "gum"
brew "htop"
brew "python@3.14"
brew "lsd"
brew "mac-cleanup-py"
brew "mkdocs"
brew "moreutils"
brew "nano"
brew "nanorc"
brew "ncdu"
brew "nethogs"
brew "python@3.13"
brew "nmap"
brew "node@22", link: true
brew "nvm"
brew "openjdk"
brew "openssh"
brew "pandoc"
brew "paperkey"
brew "pinentry-mac"
brew "pipx"
brew "poppler"
brew "pwgen"
brew "pyenv"
brew "python@3.12"
brew "qemu"
brew "qrencode"
brew "rclone"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "tealdeer"
brew "topgrade"
brew "trash"
brew "tree"
brew "watch"
brew "wget"
brew "whisper-cpp"
brew "yt-dlp"
brew "zsh"
cask "1password"
cask "1password-cli"
cask "4k-video-downloader+"
cask "a-better-finder-rename"
cask "adapter"
cask "aldente"
cask "appcleaner"
cask "arctic"
cask "audio-hijack"
cask "auto-claude"
cask "balenaetcher"
cask "brave-browser"
cask "calibre"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "cryptomator"
cask "descript"
cask "discord"
cask "disk-drill"
cask "dropbox"
cask "etrecheckpro"
cask "farrago"
cask "firefox"
cask "fission"
cask "folx"
cask "github"
cask "google-chrome"
cask "google-chrome@canary"
cask "google-drive"
cask "gpg-suite-no-mail"
cask "handbrake-app"
cask "helium-browser"
cask "hot"
cask "ilok-license-manager"
cask "iterm2"
cask "izotope-product-portal"
cask "jordanbaird-ice"
cask "keka"
cask "keybase"
cask "keyboardcleantool"
cask "kid3"
cask "kobo"
cask "loopback"
cask "losslesscut"
cask "macfuse"
cask "macwhisper"
cask "mdrp"
cask "mediainfo"
cask "minecraft"
cask "musicbrainz-picard"
cask "nordvpn"
cask "omnidisksweeper"
cask "onyx"
cask "openaudible"
cask "openmtp"
cask "piezo"
cask "pulsar"
cask "raspberry-pi-imager"
cask "raycast"
cask "samsung-magician"
cask "screenflow"
cask "shutter-encoder"
cask "signal"
cask "slack"
cask "soundsource"
cask "stats"
cask "steam"
cask "subler"
cask "swift-publisher"
cask "the-unarchiver"
cask "timemachineeditor"
cask "typora"
cask "utm"
cask "veracrypt"
cask "vlc"
cask "waves-central"
cask "whatsapp"
cask "zoom"
